In [1]:
import pandas as pd
import numpy as np

In [2]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}

In [3]:
df = pd.DataFrame(Dict)
df

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [4]:
type(df)

type(df["Ville"])

df.index #colonnes des clés

df.columns # nom des en-tetes

Index(['Age', 'Ville'], dtype='object')

In [5]:
Dict = {"Prénom": ["Sylvie", "Gilles", "Sylvain", "Thomas"], "Age": [25, 30, 35, 40]}

df = pd.DataFrame(Dict) #sans précision les index par defaut sont appliqués

df

df = pd.DataFrame(Dict, index=["L1", "L2","L3","L4"])
df

     Prénom  Age
L1   Sylvie   25
L2   Gilles   30
L3  Sylvain   35
L4   Thomas   40

In [6]:
DF = pd.DataFrame(Dict, index = range(1, 5))
DF

    Prénom  Age
1   Sylvie   25
2   Gilles   30
3  Sylvain   35
4   Thomas   40

In [7]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}

In [8]:
df = pd.DataFrame(Dict)
df

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [9]:
df["Age"]

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [10]:
df.Age

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [11]:
print(df)
print("**************")
print(df.loc['Gilles'])
print("**************")
print(df.iloc[1])
print("**************")

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans
**************
Age        30.0
Ville    Angers
Name: Gilles, dtype: object
**************
Age        35.0
Ville    Vannes
Name: Sylvain, dtype: object
**************